* 2017
** 2017-07 July
*** 2017-07-21 Friday
**** ON Call
     |-------+----+----+------------------+------+-------|
     | Short | -2 | ON | <2017-07-21 Fri> |   13 | Call  |
     |-------+----+----+------------------+------+-------|
     |       |    |    | <2016-12-29 Thu> | 3.06 | Trade |
     |-------+----+----+------------------+------+-------|
     | Total |    |    |                  | 3.06 |       |
     |-------+----+----+------------------+------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
** 2017-08 August
*** 2017-08-18 Friday
**** ED Call
     |-------+----+----+------------------+------+---------------|
     | Short | -1 | ED | <2017-08-18 Fri> | 77.5 | Call          |
     |-------+----+----+------------------+------+---------------|
     |       |    |    | <2016-12-08 Thu> | 1.88 | Trade         |
     |       |    |    | <2017-04-19 Wed> | 1.94 | Roll MAY->AUG |
     |-------+----+----+------------------+------+---------------|
     | Total |    |    |                  | 3.82 |               |
     |-------+----+----+------------------+------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** HD Call
     |-------+----+----+-------------------+------+---------------|
     | Short | -1 | HD | <2017-08-18 Fri>  |  145 | Call          |
     |-------+----+----+-------------------+------+---------------|
     |       |    |    | <2017-01-13 Fri>  | 0.64 | Trade         |
     |       |    |    | <2017-03-03 Fri>  | 1.19 | Roll MAR->APR |
     |       |    |    | <2017-04-03 Mon>  | 1.60 | Roll APR->MAY |
     |       |    |    | <2017-04-19 Wed>  | 0.50 | Roll MAY->JUN |
     |       |    |    | <2017-05-24 Wped> | 1.41 | Roll JUN->AUG |
     |-------+----+----+-------------------+------+---------------|
     | Total |    |    |                   | 5.34 |               |
     |-------+----+----+-------------------+------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** QQQ Call
     |-------+----+-----+------------------+-------+---------------|
     | Short | -1 | QQQ | <2017-08-18 Fri> |   134 | Call          |
     |-------+----+-----+------------------+-------+---------------|
     |       |    |     | <2017-01-23 Mon> |  2.88 | Trade         |
     |       |    |     | <2017-03-06 Mon> |  0.28 |               |
     |       |    |     | <2017-03-16 Thu> | -0.16 | Roll APR->MAY |
     |       |    |     | <2017-05-11 Thu> |  0.49 | Roll MAY->AUG |
     |-------+----+-----+------------------+-------+---------------|
     | Total |    |     |                  |  3.49 |               |
     |-------+----+-----+------------------+-------+---------------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
**** QQQ Big Lizard
     |-------+----+-----+------------------+-------+-------|
     | Short | -3 | QQQ | <2017-08-18 Fri> |   138 | Put   |
     | Short | -3 | QQQ | <2017-08-18 Fri> |   138 | Call  |
     | Long  |  3 | QQQ | <2017-08-18 Fri> |   144 | Call  |
     |-------+----+-----+------------------+-------+-------|
     |       |    |     | <2017-05-11 Thu> | 18.88 | Trade |
     |-------+----+-----+------------------+-------+-------|
     | Total |    |     |                  | 18.88 |       |
     |-------+----+-----+------------------+-------+-------|
     #+TBLFM: @>$5=vsum(@II..III);%.2f
